app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def show
        event = Event.find_by(id: params[:id])

INSERT INTO "events" ("neighborhood_id", "name", "address", "start_time", "interested_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        event = Event.create(name: params[:name], address: params[:address], start_time: params[:start_time], neighborhood_id: params[:neighborhood_id] , interested_count: params[:interested_count])

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "events" SET "interested_count" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["interested_count", 27], ["updated_at", "2020-01-22 23:40:30.757955"], ["id", 1]]
---
    def update
        event = Event.find_by(id: params[:id][-1])
        event.update(interested_count: params[:interested_count])