app/controllers/neighborhoods_controller.rb

SELECT "neighborhoods".* FROM "neighborhoods"
---
    def index
        neighborhoods = Neighborhood.all