app/controllers/performers_controller.rb

	def index
		performers = Performer.all
---
SELECT "performers".* FROM "performers"